000_РОЗНИЦА_ЦЕНТР/src/Documents/УстановкаЛимитовРучныхСкидокРегион/УстановкаЛимитовРучныхСкидокРегион.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЛимитовРучныхСкидокРегион</name>
  <registerRecords>InformationRegister.ЛимитыРучныхСкидокУстановлены</registerRecords>
  <registerRecords>AccumulationRegister.ЛимитыРучныхСкидокРегионы</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделениеОрганизации</name>
    <comment>Определяет филиал</comment>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Лимиты</name>
    <attributes>
      <name>ПричинаРучнойСкидки</name>
      <type>
        <types>CatalogRef.ПричиныРучнойСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/Documents/УстановкаЛимитовРучныхСкидокРегион/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.ОбособленноеПодразделениеОрганизации КАК ОбособленноеПодразделениеОрганизации
	|ИЗ
	|	Документ.УстановкаЛимитовРучныхСкидокРегион КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка"
	);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	РезультатЗапроса = Запрос.Выполнить();
	Реквизиты = РезультатЗапроса.Выбрать();
	Реквизиты.Следующий(); 
	
	ОбщегоНазначенияРТ.ПеренестиСтрокуВыборкиВПараметрыЗапроса(РезультатЗапроса, Реквизиты, Запрос);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Ссылка КАК Регистратор,
	|	&ОбособленноеПодразделениеОрганизации КАК ОбособленноеПодразделениеОрганизации,
	|	ТаблицаДокументы.ПричинаРучнойСкидки,
	|	ТаблицаДокументы.Сумма,
	|	ТаблицаДокументы.НомерСтроки
	|ПОМЕСТИТЬ Источник
	|ИЗ
	|	Документ.УстановкаЛимитовРучныхСкидокРегион.Лимиты КАК ТаблицаДокументы
	|ГДЕ
	|	ТаблицаДокументы.Ссылка = &ДокументСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументы.Период КАК Период,
	|	ТаблицаДокументы.Регистратор КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	НАЧАЛОПЕРИОДА(ТаблицаДокументы.Период, МЕСЯЦ) КАК ПериодЛимита,
	|	ТаблицаДокументы.ПричинаРучнойСкидки,
	|	ТаблицаДокументы.ОбособленноеПодразделениеОрганизации,
	|	ТаблицаДокументы.Сумма,
	|	ТаблицаДокументы.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Источник КАК ТаблицаДокументы
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументы.Период КАК Период,
	|	ТаблицаДокументы.Регистратор КАК Регистратор,
	|	НАЧАЛОПЕРИОДА(ТаблицаДокументы.Период, МЕСЯЦ) КАК ПериодЛимита,
	|	ТаблицаДокументы.ПричинаРучнойСкидки,
	|	ТаблицаДокументы.ОбособленноеПодразделениеОрганизации,
	|	ТаблицаДокументы.Сумма,
	|	ТаблицаДокументы.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Источник КАК ТаблицаДокументы
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки"
	;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);

	Результаты = Запрос.ВыполнитьПакет();

	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаЛимитыРучныхСкидокРегионы"    , Результаты[1].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаЛимитыРучныхСкидокУстановлены", Результаты[2].Выгрузить());

КонецПроцедуры

#КонецОбласти

#КонецЕсли
